/* Преобразование типов
важность: 5
Какой результат будет у выражений ниже? */

"" + 1 + 0 // = "10" из-за пустоты в "" и знака +
"" - 1 + 0 // = -1 из-за знака -
true + false // = true 
6 / "3" // = 2
"2" * "3" // = 6
4 + 5 + "px" // = "9px"
"$" + 4 + 5 // = "$45"
"4" - 2 // = 2
"4px" - 2 // NaN
"  -9  " + 5 // = "  -9  5"
"  -9  " - 5 // = -14
null + 1 // = 1
undefined + 1 // = NaN
" \t \n" - 2 // = -2  -" \t \n" имеет значение 0, так как пробельные символы игнорируются при переводе строки в число